Revit 2027 API
Stone.StonePatternMap Property
 The property labeled "Image" from the "Stone" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string StonePatternMap { get; }
Public Shared ReadOnly Property StonePatternMap As String
	Get
public:
static property String^ StonePatternMap {
	String^ get ();
}
static member StonePatternMap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Stone Class
Autodesk.Revit.DB.Visual Namespace